str_polz=input("Введите строку: ")#запрос строки от пользователя
print("длина вашей строки : " , len(str_polz))#вывод длины строки на экран
glasn=0#счетчик гласных
soglasn=0#счетчик согласных
for i in str_polz:#цикл 
    if i=="а" or i=="е" or i =="ё" or i =="и"or i =="о" or i =="у" or i =="ы" or i =="э" or i =="ю" or i =="я":#проверка на гласные буквы
        glasn+=1#увеличение счетчика гласных на 1
    else :#нахождение согласных
        soglasn+=1#увеличение счетчика согласных на 1
print("Кол-во гласных в вашей строке: ", glasn )#вывод на экран информации о гласных
print("Кол-во согласных в вашей строке: ", soglasn )#вывод на экран информации о согласных
