str_polz = input("Введите строку: ") # Запрос строки от пользователя
str_polz = str_polz.lower() # Нижний регистр
print("длина вашей строки : ", len(str_polz)) # Вывод длины строки на экран

glasn = 0 # Счетчик гласных
soglasn= 0 # Счетчик согласных

for i in str_polz: # Цикл 
    if i == "а" or i == "е" or i == "ё" or i == "и" or i == "о" or i == "у" or i == "ы" or i == "э" or i == "ю" or i == "я": # Проверка на гласные буквы
        glasn += 1 # Увеличение счетчика гласных на 1
    elif i == " ": # Пробел не относится
        pass # Пустой блок
    else : # Нахождение согласных
        soglasn += 1 # Увеличение счетчика согласных на 1
        
print("Кол-во гласных в вашей строке: ", glasn) # Вывод на экран информации о гласных
print("Кол-во согласных в вашей строке: ", soglasn) # Вывод на экран информации о согласных
